04_Simulation/0.BASELINE/para-database-for-PIML-master/pehill-5-cases-OpenFOAM/case_1p0_refined_kOmegaSST_OF7_no_inlet_profiles/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

momentumSource
{
    type            meanVelocityForce; //pressureGradientExplicitSource;
    active          on;            //on/off switch
    selectionMode   all;       //cellSet // points //cellZone

    fields          (U);
    Ubar            (0.020188 0 0 );
    
    //pressureGradientExplicitSourceCoeffs
    //{
    //    fieldNames  (U);
    //    Ubar        (0.020188 0 0 );
    //}
}

//momentumSource
//{
//    type            meanVelocityForce;
//
//    selectionMode   cellZone;
//    cellZone        inletCellZone;
//
//    fields          (U);
//    Ubar            (1 0 0);
//}

// ************************************************************************* //
